title: Detect Regsvr32 Remote Scriptlet Execution (Squiblydoo)
id: 1
status: test
description: Detects execution of regsvr32.exe to run a remote scriptlet file (.sct) via HTTP, a technique known as Squiblydoo for bypassing application whitelisting.
reference:
  - https://www.ired.team/offensive-security/code-execution/t1117-regsvr32-aka-squiblydoo
author: Duan Tran Ngoc
date: 2024-09-24
modified: 2024-09-24
tags:
  - attack.defense_evasion
  - attack.T1218.010
  - attack.execution
  - attack.T1059.007
logsource:
  category: process_creation
  product: windows

detection:
  selection:
    Image: '*\regsvr32.exe'
    CommandLine|contains|all:
      - '/i:'
      - '.sct'
      - 'http://'
  
  condition: selection

fields:
  - CommandLine
  - ParentImage
  - Image

falsepositives:
  - Legitimate use of regsvr32 to register legitimate COM objects or libraries

level: high
