title: Detect Process Injection via CreateRemoteThread
id: 1
status: test
description: Detects process injection attempts through the use of CreateRemoteThread, which is commonly used in code injection techniques.
references:
  - https://www.ired.team/offensive-security/code-injection-process-injection/process-injection
author: Duan Tran Ngoc
date: 2024-09-27
modified: 2024-09-27
tags:
  - attack.injection
  - attack.execution
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    EventID: 8
    Image: '*'
    TargetImage: '*'
  condition: selection
  timeframe: 1m
falsepositives:
  - Legitimate application activity (e.g., legitimate software using CreateRemoteThread)
  - Other known system processes using similar behavior
fields:
  - EventID
  - Image
  - TargetImage
  - ProcessId
  - ParentImage
  - ParentProcessId
  - CommandLine
  - User
level: high
