title: Possible Windows DLL Hijacking
id: 2
status: experimental
description: Detects possible DLL hijacking of vulnerable Windows DLLs not under the Windows folder.
references:
    - https://www.ired.team/offensive-security/code-injection-process-injection/dll-injection
author: Duan Tran Ngoc
date: 2024-09-27
modified: 2024-09-27
tags:
    - attack.defense_evasion
    - attack.T1038
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventID: 7
        ImageLoaded: "*.dll"
    filter:
        EventID: 7
        ImageLoaded:
            - "C:\\Windows\\WinSxS\\*"
            - "C:\\Windows\\System32\\*"
            - "C:\\Windows\\SysWOW64\\*"
    condition: selection and not filter
falsepositives:
    - Very likely, needs more tuning
level: high