title: Detect WMIC executing XSL for process creation
id: 7
status: test
description: Detects execution of WMIC to run a XSL file that may lead to code execution.
reference:
  - https://www.ired.team/offensive-security/code-execution/application-whitelisting-bypass-with-wmic-and-xsl
author: Duan Tran Ngoc
date: 2024-09-24
modified: 2024-09-24
tags:
  - attack.execution
  - attack.T1218.001
  - attack.defense_evasion
  - attack.T1059.001
logsource:
  category: process_creation
  product: windows

detection:
  selection:
    Image: '*\wmic.exe'
    CommandLine|contains:
      - '.xsl'

  condition: selection

fields:
  - CommandLine
  - ParentImage
  - Image

falsepositives:
  - Legitimate usage of WMIC in administrative scripts or system maintenance tasks

level: high
