title: Detect CPL File Execution via Control.exe through Rundll32.exe
id: 3
status: test
description: Detects execution of .cpl files using rundll32.exe spawned by control.exe
reference:
  - https://www.ired.team/offensive-security/code-execution/t1196-control-panel-item-code-execution
author: Duan Tran Ngoc
date: 2024-09-24
modified: 2024-09-24
tags:
  - attack.execution
  - attack.t1202
logsource:
  category: process_creation
  product: windows
detection:
  parent_control:
    ParentImage: 'control.exe'
    Image: 'rundll32.exe'
    CommandLine|contains: '.cpl'
  condition: parent_control
fields:
  - _time
  - ComputerName
  - Image
  - ParentImage
  - CommandLine
falsepositives:
  - Legitimate use of control panel applets
level: high